In [1]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [3]:
titles = pd.read_csv('data/titles.csv')
titles.head()

              title  year
0       Narcissists  2014
1          Celebici  2008
2  Dregs of Society  2010
3   Patsamba-tsamba  1964
4     Watching Eyes  1921

In [4]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

### Which three years of the 1930s saw the most films released?

### Plot the number of films that have been released each decade over the history of cinema.

### Plot the number of "Hamlet" films made each decade.

### Plot the number of "Rustler" characters in each decade of the history of film.

### Plot the number of "Hamlet" characters each decade.

### What are the 11 most common character names in movie history?

### Who are the 10 people most often credited as "Herself" in film history?

### Who are the 10 people most often credited as "Himself" in film history?

### Which actors or actresses appeared in the most movies in the year 1945?

### Which actors or actresses appeared in the most movies in the year 1985?

### Plot how many roles Mammootty has played in each year of his career.

### What are the 10 most frequent roles that start with the phrase "Patron in"?

### What are the 10 most frequent roles that start with the word "Science"?

### Plot the n-values of the roles that Judi Dench has played over her career.

### Plot the n-values of Cary Grant's roles through his career.

### Plot the n-value of the roles that Sidney Poitier has acted over the years.

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [5]:
c = titles
c[c.title == 'Hamlet']

         title  year
10490   Hamlet  1910
11599   Hamlet  1913
39434   Hamlet  1996
44802   Hamlet  2000
46080   Hamlet  2009
54935   Hamlet  1954
58070   Hamlet  2011
63449   Hamlet  2015
75967   Hamlet  1976
90305   Hamlet  1948
99204   Hamlet  2016
114323  Hamlet  2014
139275  Hamlet  1964
148469  Hamlet  1969
150502  Hamlet  1911
164289  Hamlet  1987
178633  Hamlet  1990
200540  Hamlet  1973
210052  Hamlet  2017
215410  Hamlet  1921

In [6]:
'Hamle'.startswith('H')

True